# PlanarMultiPlanarShape Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..PlanarMultiPlanarShape Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PlanarMultiPlanarShape { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlanarMultiPlanarShape As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PlanarMultiPlanarShape {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace